//{
//	// 124142352345 #@$^W^$##$^% ASFASDadfasfffds .//,/.
//}
//
//{
//	{0 1} 二进制
//	{0 1 2 3 4 5 6 7 8 9} //10进制数字
//	{0 1 2 3 4 5 6 7 8 9 A B C D E F / a b c d e f} //16进制
//	{a b c d e f g h i j k l m n o p q r s t u v w x y z } //小写字母
//	{A B C D E F G H I J K L M N O P Q R S T U V W X Y Z } //大写字母
//	//Monster //字母
//	//123ADwrwr //字母数字字符
//	// ! " # $ % & ' ( ) * + , - . / : ; < = > ? @ [ \ ] ^ _ ` { | } ~ //标点符号字符
//	//字母数字和标点符号组合集合
//	//空格字符 :       制表符、换行符、垂直制表符、换页符、回车符、空格符 的集合。
//	//可打印字符：		空格字符 + 字母数字字符 + 标点符号字符
//	//控制字符： ASCII 编码8进制 000 - 037 177
//	//空白字符 ： 空格符+制表符。
//}